src/Catalogs/ЦентральныеСерверы/ЦентральныеСерверы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЦентральныеСерверы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АдресRAS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортRAS</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидХраненияАккаунта</name>
    <type>
      <types>EnumRef.ВидыХраненияАккаунтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.Аккаунты</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидыХраненияАккаунтов/ВидыХраненияАккаунтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыХраненияАккаунтов</name>
  <enumValues>
    <name>ЛогинПароль</name>
  </enumValues>
  <enumValues>
    <name>ОбщийАккаунт</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ЦентральныеСерверы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает параметры администрирования кластера для подключения через протокол RAS к указанному центральному серверу.
// Получает данные аутентификации из настроек центрального сервера в зависимости от вида хранения аккаунта.
//
// Параметры:
//  ЦентральныйСервер - Структура:
//                        * АдресRAS - Строка - адрес сервера RAS
//                        * ПортRAS - Строка - порт сервера RAS
//                        * ВидХраненияАккаунта - ПеречислениеСсылка.ВидыХраненияАккаунтов
//                        * Аккаунт - СправочникСсылка.Аккаунты
//                        * Логин - Строка
//                        * Ссылка - СправочникСсылка.ЦентральныеСерверы
//                      - выборка из результата запроса по справочнику ЦентральныеСерверы
//
// Возвращаемое значение:
//   см. АдминистрированиеКластера.ПараметрыАдминистрированияКластера
//
Функция ПараметрыАдминистрированияКластераRAS(Знач ЦентральныйСервер) Экспорт
	ЛогинПароль = ПолучитьДанныеАутентификации(ЦентральныйСервер);
	
	ПараметрыАдминистрированияКластера = АдминистрированиеКластера.ПараметрыАдминистрированияКластера();
	ПараметрыАдминистрированияКластера.ТипПодключения = "RAS";
	ПараметрыАдминистрированияКластера.АдресСервераАдминистрирования = ЦентральныйСервер.АдресRAS;
	ПараметрыАдминистрированияКластера.ПортСервераАдминистрирования = Число(ЦентральныйСервер.ПортRAS);
	ПараметрыАдминистрированияКластера.ИмяАдминистратораКластера = ЛогинПароль.Логин;
	ПараметрыАдминистрированияКластера.ПарольАдминистратораКластера = ЛогинПароль.Пароль;
	
	Возврат ПараметрыАдминистрированияКластера;
КонецФункции

// Возвращает логин и пароль для подключения к центральному серверу в зависимости от вида хранения аккаунта.
//
// Параметры:
//  ЦентральныйСервер - Структура:
//                        * ВидХраненияАккаунта - ПеречислениеСсылка.ВидыХраненияАккаунтов
//                        * Аккаунт - СправочникСсылка.Аккаунты
//                        * Логин - Строка
//                        * Ссылка - СправочникСсылка.ЦентральныеСерверы
//                      - выборка из результата запроса по справочнику ЦентральныеСерверы
//
// Возвращаемое значение:
//   Структура:
//       * Логин - Строка - логин для подключения к RAS
//       * Пароль - Строка - пароль для подключения к RAS
//
Функция ПолучитьДанныеАутентификации(Знач ЦентральныйСервер) Экспорт
	ЛогинПароль = Новый Структура("Логин, Пароль", "", "");
	
	Если ЦентральныйСервер.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ОбщийАккаунт Тогда
		Если ЗначениеЗаполнено(ЦентральныйСервер.Аккаунт) Тогда
			ЛогинПароль.Логин = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦентральныйСервер.Аккаунт, "Логин");
			ЛогинПароль.Пароль = ОбщегоНазначенияСтраж.ПолучитьПароль(ЦентральныйСервер.Аккаунт);
		КонецЕсли;
	ИначеЕсли ЦентральныйСервер.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль Тогда
		ЛогинПароль.Логин = ЦентральныйСервер.Логин;
		ЛогинПароль.Пароль = ОбщегоНазначенияСтраж.ПолучитьПароль(ЦентральныйСервер.Ссылка);
	КонецЕсли;
	Возврат ЛогинПароль;
КонецФункции

#КонецОбласти

#КонецЕсли
